HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_reg.h
/** Alias (User Manual Name) for XBAR_ARBITER4_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER4_DBMADD.
*/
#define	XBAR_DBMADD4	(XBAR_ARBITER4_DBMADD)

/** \\brief  154, Error/Debug Capture Register */
#define XBAR_ARBITER4_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700154u)

/** Alias (User Manual Name) for XBAR_ARBITER4_ERR.
* To use register names with standard convension, please use XBAR_ARBITER4_ERR.
*/
#define	XBAR_ERR4	(XBAR_ARBITER4_ERR)

/** \\brief  150, Error/Debug Address Capture Register */
#define XBAR_ARBITER4_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700150u)

/** Alias (User Manual Name) for XBAR_ARBITER4_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER4_ERRADDR.
*/
#define	XBAR_ERRADDR4	(XBAR_ARBITER4_ERRADDR)

/** \\brief  148, Arbiter Priority Register */
#define XBAR_ARBITER4_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700148u)

/** Alias (User Manual Name) for XBAR_ARBITER4_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER4_PRIOH.
*/
#define	XBAR_PRIOH4	(XBAR_ARBITER4_PRIOH)

/** \\brief  14C, Arbiter Priority Register */
#define XBAR_ARBITER4_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870014Cu)

/** Alias (User Manual Name) for XBAR_ARBITER4_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER4_PRIOL.
*/
#define	XBAR_PRIOL4	(XBAR_ARBITER4_PRIOL)

/** \\brief  184, Arbiter Control Register */
#define XBAR_ARBITER5_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700184u)

/** Alias (User Manual Name) for XBAR_ARBITER5_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER5_ARBCON.
*/
#define	XBAR_ARBCON5	(XBAR_ARBITER5_ARBCON)

/** \\brief  19C, Debug Address Register */
#define XBAR_ARBITER5_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER5_DBADD*)0xF870019Cu)

/** Alias (User Manual Name) for XBAR_ARBITER5_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER5_DBADD.
*/
#define	XBAR_DBADD5	(XBAR_ARBITER5_DBADD)

/** \\brief  198, Debug Control Register */
#define XBAR_ARBITER5_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700198u)

/** Alias (User Manual Name) for XBAR_ARBITER5_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER5_DBCON.
*/
#define	XBAR_DBCON5	(XBAR_ARBITER5_DBCON)

/** \\brief  1A0, Debug Mask Address Register */
#define XBAR_ARBITER5_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER5_DBMADD*)0xF87001A0u)

/** Alias (User Manual Name) for XBAR_ARBITER5_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER5_DBMADD.
*/
#define	XBAR_DBMADD5	(XBAR_ARBITER5_DBMADD)

/** \\brief  194, Error/Debug Capture Register */
#define XBAR_ARBITER5_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700194u)

/** Alias (User Manual Name) for XBAR_ARBITER5_ERR.
* To use register names with standard convension, please use XBAR_ARBITER5_ERR.
*/
#define	XBAR_ERR5	(XBAR_ARBITER5_ERR)

/** \\brief  190, Error/Debug Address Capture Register */
#define XBAR_ARBITER5_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700190u)

/** Alias (User Manual Name) for XBAR_ARBITER5_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER5_ERRADDR.
*/
#define	XBAR_ERRADDR5	(XBAR_ARBITER5_ERRADDR)

/** \\brief  188, Arbiter Priority Register */
#define XBAR_ARBITER5_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700188u)

/** Alias (User Manual Name) for XBAR_ARBITER5_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER5_PRIOH.
*/
#define	XBAR_PRIOH5	(XBAR_ARBITER5_PRIOH)

/** \\brief  18C, Arbiter Priority Register */
#define XBAR_ARBITER5_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870018Cu)

/** Alias (User Manual Name) for XBAR_ARBITER5_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER5_PRIOL.
*/
#define	XBAR_PRIOL5	(XBAR_ARBITER5_PRIOL)

/** \\brief  1C4, Arbiter Control Register */
#define XBAR_ARBITER6_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF87001C4u)

/** Alias (User Manual Name) for XBAR_ARBITER6_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER6_ARBCON.
*/
#define	XBAR_ARBCON6	(XBAR_ARBITER6_ARBCON)

/** \\brief  1DC, Debug Address Register */
#define XBAR_ARBITER6_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER6_DBADD*)0xF87001DCu)

/** Alias (User Manual Name) for XBAR_ARBITER6_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER6_DBADD.
*/
#define	XBAR_DBADD6	(XBAR_ARBITER6_DBADD)

/** \\brief  1D8, Debug Control Register */
#define XBAR_ARBITER6_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF87001D8u)

/** Alias (User Manual Name) for XBAR_ARBITER6_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER6_DBCON.
*/
#define	XBAR_DBCON6	(XBAR_ARBITER6_DBCON)

/** \\brief  1E0, Debug Mask Address Register */
#define XBAR_ARBITER6_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER6_DBMADD*)0xF87001E0u)

/** Alias (User Manual Name) for XBAR_ARBITER6_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER6_DBMADD.
*/
#define	XBAR_DBMADD6	(XBAR_ARBITER6_DBMADD)

/** \\brief  1D4, Error/Debug Capture Register */
#define XBAR_ARBITER6_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF87001D4u)

/** Alias (User Manual Name) for XBAR_ARBITER6_ERR.
* To use register names with standard convension, please use XBAR_ARBITER6_ERR.
*/
#define	XBAR_ERR6	(XBAR_ARBITER6_ERR)

/** \\brief  1D0, Error/Debug Address Capture Register */
#define XBAR_ARBITER6_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF87001D0u)

/** Alias (User Manual Name) for XBAR_ARBITER6_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER6_ERRADDR.
*/
#define	XBAR_ERRADDR6	(XBAR_ARBITER6_ERRADDR)

/** \\brief  1C8, Arbiter Priority Register */
#define XBAR_ARBITER6_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF87001C8u)

/** Alias (User Manual Name) for XBAR_ARBITER6_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER6_PRIOH.
*/
#define	XBAR_PRIOH6	(XBAR_ARBITER6_PRIOH)

/** \\brief  1CC, Arbiter Priority Register */
#define XBAR_ARBITER6_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF87001CCu)

/** Alias (User Manual Name) for XBAR_ARBITER6_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER6_PRIOL.
*/
#define	XBAR_PRIOL6	(XBAR_ARBITER6_PRIOL)

/** \\brief  204, Arbiter Control Register */
#define XBAR_ARBITER7_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700204u)

