HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_reg.h
/** Alias (User Manual Name) for XBAR_ARBITERD_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITERD_ARBCON.
*/
#define	XBAR_ARBCOND	(XBAR_ARBITERD_ARBCON)

/** \\brief  1C, Debug Address Register */
#define XBAR_ARBITERD_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITERD_DBADD*)0xF870001Cu)

/** Alias (User Manual Name) for XBAR_ARBITERD_DBADD.
* To use register names with standard convension, please use XBAR_ARBITERD_DBADD.
*/
#define	XBAR_DBADDD	(XBAR_ARBITERD_DBADD)

/** \\brief  18, Debug Control Register */
#define XBAR_ARBITERD_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700018u)

/** Alias (User Manual Name) for XBAR_ARBITERD_DBCON.
* To use register names with standard convension, please use XBAR_ARBITERD_DBCON.
*/
#define	XBAR_DBCOND	(XBAR_ARBITERD_DBCON)

/** \\brief  20, Debug Mask Address Register */
#define XBAR_ARBITERD_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITERD_DBMADD*)0xF8700020u)

/** Alias (User Manual Name) for XBAR_ARBITERD_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITERD_DBMADD.
*/
#define	XBAR_DBMADDD	(XBAR_ARBITERD_DBMADD)

/** \\brief  14, Error/Debug Capture Register */
#define XBAR_ARBITERD_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700014u)

/** Alias (User Manual Name) for XBAR_ARBITERD_ERR.
* To use register names with standard convension, please use XBAR_ARBITERD_ERR.
*/
#define	XBAR_ERRD	(XBAR_ARBITERD_ERR)

/** \\brief  10, Error/Debug Address Capture Register */
#define XBAR_ARBITERD_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700010u)

/** Alias (User Manual Name) for XBAR_ARBITERD_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITERD_ERRADDR.
*/
#define	XBAR_ERRADDRD	(XBAR_ARBITERD_ERRADDR)

/** \\brief  8, Arbiter Priority Register */
#define XBAR_ARBITERD_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700008u)

/** Alias (User Manual Name) for XBAR_ARBITERD_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITERD_PRIOH.
*/
#define	XBAR_PRIOHD	(XBAR_ARBITERD_PRIOH)

/** \\brief  C, Arbiter Priority Register */
#define XBAR_ARBITERD_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870000Cu)

/** Alias (User Manual Name) for XBAR_ARBITERD_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITERD_PRIOL.
*/
#define	XBAR_PRIOLD	(XBAR_ARBITERD_PRIOL)

/** \\brief  40C, Debug Trigger Event Status Register */
#define XBAR_DBSAT /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBSAT*)0xF870040Cu)

/** \\brief  180, External Control Register 5 */
#define XBAR_EXTCON5 /*lint --e(923)*/ (*(volatile Ifx_XBAR_EXTCON5*)0xF8700180u)

/** \\brief  408, Module Identification Register */
#define XBAR_ID /*lint --e(923)*/ (*(volatile Ifx_XBAR_ID*)0xF8700408u)

/** \\brief  418, Transaction ID Interrupt Enable Register */
#define XBAR_IDINTEN /*lint --e(923)*/ (*(volatile Ifx_XBAR_IDINTEN*)0xF8700418u)

/** \\brief  414, Transaction ID Interrupt Status Register */
#define XBAR_IDINTSAT /*lint --e(923)*/ (*(volatile Ifx_XBAR_IDINTSAT*)0xF8700414u)

/** \\brief  410, Arbiter Interrupt Status Register */
#define XBAR_INTSAT /*lint --e(923)*/ (*(volatile Ifx_XBAR_INTSAT*)0xF8700410u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_REG_H */
